<?

class miss_redParams extends Params {
    public $reels = array(
        array(
            array(8,10,3,1,8,10,3,6,1,10,3,8,10,6,3,10,6,1,3,10,8,6,10,8,2,10,8,6,10,3,6,10,2,8,6,10,9,10,8,10,6,1,8,6,8,8,6,3,8,10,7,2,10,8,6,10,4,8,10,6,3,2,6,10,8,6,10,8,6,10,1,5,10,3,8,10,8,10,3,6,1,10,3,8,10,6,3,10,6,1,3,10,8,6,10,8,10,8,2,10,8,6,3,6,10,2,8,6,10,9,10,8,10,6,1,8,6,8,8,6,3,8,10,7,6,2,10,8,6,10,4,8,10,6,3,2,10,8,6,10,8,6,10,1,8,5,10,8,10,2,3,8,10,10,3,6,1,10,3,8,10,6,3,10,6,8,1,3,10,8,6,10,8,10,8,2,10,8,6,10,3,6,10,2,8,6,10,8,9,10,8,10,1,8,6,3,8,6,10,7,8,4,8,10,3,2,10,6,8,10,8,5,10,),
            array(9,1,3,9,1,5,51,7,6,2,5,10,5,1,1,4,7,9,7,51,9,4,7,1,1,9,7,1,9,4,5,2,2,2,9,51,7,1,5,7,2,2,7,9,7,1,1,1,1,4,7,9,1,5,7,5,1,9,51,7,2,2,2,2,2,9,4,5,2,2,2,2,9,5,9,2,2,5,4,1,1,9,4,5,51,4,8,5,2,9,7,1,1,1,4,5,9,2,2,7,5,4,2,2,2,2,9,7,9,1,1,4,9,7,),
            array(10,51,6,8,3,6,8,2,10,5,10,1,6,3,8,2,3,6,8,1,3,10,8,51,10,8,3,2,7,8,1,8,3,8,51,10,3,10,1,8,3,6,2,10,8,3,1,10,6,8,51,10,1,8,6,10,2,8,3,8,2,10,3,1,9,4,10,2,10,8,),
            array(9,1,5,9,2,2,2,2,5,7,1,6,5,1,1,10,4,7,2,2,9,7,51,9,4,1,7,9,1,1,1,1,7,9,2,2,2,2,4,5,9,51,7,5,7,2,2,2,7,9,7,1,1,1,1,4,7,9,1,7,5,51,9,7,3,2,2,5,9,4,2,2,5,9,5,51,5,4,1,9,4,5,1,1,4,8,5,1,9,7,2,4,5,1,1,9,7,5,2,2,9,7,2,2,2,2,2,4,9,1,1,7,4,7,),
            array(8,10,3,8,10,3,6,1,10,3,8,10,6,3,10,2,6,3,10,8,6,10,1,8,10,8,6,10,3,2,6,10,8,6,10,9,10,8,2,10,6,8,6,8,8,6,3,1,8,10,7,8,6,10,4,8,10,1,6,3,10,8,6,10,8,6,10,2,5,10,8,10,3,8,10,10,3,6,1,10,3,8,10,3,10,6,3,10,8,6,10,1,8,10,8,6,10,3,2,6,10,8,6,10,9,10,8,2,10,6,8,6,8,8,6,3,8,10,2,7,10,8,6,10,4,8,10,1,6,3,10,8,6,1,10,8,6,10,8,2,5,10,8,10,3,8,10,10,3,6,1,10,3,8,6,3,10,6,3,10,8,6,10,8,10,1,8,10,8,6,10,3,2,6,10,8,6,10,9,10,8,2,10,6,8,6,2,6,3,8,7,10,8,1,6,8,10,4,8,10,1,8,3,10,8,3,8,6,10,8,2,5,10,),
        ),
        array(
            array(8,10,3,1,8,10,3,6,1,10,3,8,10,6,3,10,6,1,3,10,8,6,10,8,2,10,8,6,10,3,6,10,2,8,6,10,9,10,8,10,6,1,8,6,8,8,6,3,8,10,7,2,10,8,6,10,4,8,10,6,3,2,6,10,8,6,10,8,6,10,1,5,10,3,8,10,8,10,3,6,1,10,3,8,10,6,3,10,6,1,3,10,8,6,10,8,10,8,2,10,8,6,3,6,10,2,8,6,10,9,10,8,10,6,1,8,6,8,8,6,3,8,10,7,6,2,10,8,6,10,4,8,10,6,3,2,10,8,6,10,8,6,10,1,8,5,10,8,10,2,3,8,10,10,3,6,1,10,3,8,10,6,3,10,6,8,1,3,10,8,6,10,8,10,8,2,10,8,6,10,3,6,10,2,8,6,10,8,9,10,8,10,1,8,6,3,8,6,10,7,8,4,8,10,3,2,10,6,8,10,8,5,10,),
            array(9,1,3,9,1,5,51,7,6,2,5,10,5,1,1,4,7,9,7,51,9,4,7,1,1,9,7,1,9,4,5,2,2,2,9,51,7,1,5,7,2,2,7,9,7,1,1,1,1,4,7,9,1,5,7,5,1,9,51,7,2,2,2,2,2,9,4,5,2,2,2,2,9,5,9,2,2,5,4,1,1,9,4,5,51,4,8,5,2,9,7,1,1,1,4,5,9,2,2,7,5,4,2,2,2,2,9,7,9,1,1,4,9,7,),
            array(10,51,6,8,3,6,8,2,10,5,10,1,6,3,8,2,3,6,8,1,3,10,8,51,10,8,3,2,7,8,1,8,3,8,51,10,3,10,1,8,3,6,2,10,8,3,1,10,6,8,51,10,1,8,6,10,2,8,3,8,2,10,3,1,9,4,10,2,10,8,),
            array(9,1,5,9,2,2,2,2,5,7,1,6,5,1,1,10,4,7,2,2,9,7,51,9,4,1,7,9,1,1,1,1,7,9,2,2,2,2,4,5,9,51,7,5,7,2,2,2,7,9,7,1,1,1,1,4,7,9,1,7,5,51,9,7,3,2,2,5,9,4,2,2,5,9,5,51,5,4,1,9,4,5,1,1,4,8,5,1,9,7,2,4,5,1,1,9,7,5,2,2,9,7,2,2,2,2,2,4,9,1,1,7,4,7,),
            array(8,10,3,8,10,3,6,1,10,3,8,10,6,3,10,2,6,3,10,8,6,10,1,8,10,8,6,10,3,2,6,10,8,6,10,9,10,8,2,10,6,8,6,8,8,6,3,1,8,10,7,8,6,10,4,8,10,1,6,3,10,8,6,10,8,6,10,2,5,10,8,10,3,8,10,10,3,6,1,10,3,8,10,3,10,6,3,10,8,6,10,1,8,10,8,6,10,3,2,6,10,8,6,10,9,10,8,2,10,6,8,6,8,8,6,3,8,10,2,7,10,8,6,10,4,8,10,1,6,3,10,8,6,1,10,8,6,10,8,2,5,10,8,10,3,8,10,10,3,6,1,10,3,8,6,3,10,6,3,10,8,6,10,8,10,1,8,10,8,6,10,3,2,6,10,8,6,10,9,10,8,2,10,6,8,6,2,6,3,8,7,10,8,1,6,8,10,4,8,10,1,8,3,10,8,3,8,6,10,8,2,5,10,),
        ),
    );

    public $reelConfig = array(4,4,4,4,4);

    public $symbols = array(
        'b01' => array(51),
        // баба
        's01' => array(1),
        // Волк
        's02' => array(2),
        // Бабушка
        's03' => array(3),
        // Мужик
        's04' => array(4),
        // Кролик
        's05' => array(5),
        // Белка
        's06' => array(6),
        // Гриб
        's07' => array(7),
        // Шишка
        's08' => array(8),
        // Клубника
        's09' => array(9),
        // Цветок
        's10' => array(10),
        // Wolf+LittleRed
        'w01' => array(0),
        'w02' => array(20),

        'e01' => array(11),
        'e02' => array(12),
    );

    public $collectingPay = true;
    public $collectingSymbols = array(
        array(0,1,11),
        array(0,2,12),
        array(0,20),

    );
    // Вайлд
    public $wild = array(999);
    // Скаттер
    public $scatter = array(51);
    // Умножение ставки, когда выпали скаттеры
    public $scatterMultiple = array(
        '3' => 3,
    );

    public $winLines = array(

    );

    public $winLineType = 'waysLeftRightMiddle';
    public $minWinCount = 3;

    public $payOnlyHighter = true;
    // настройка ставок
    public $currency = '$';
    public $curiso = 'USD';
    public $default_coinvalue = 0.05;
    public $defaultCoinsCount = 45;

    //public $denominations = array(0.01,0.02,0.03,0.04,0.05,0.1,0.25,0.5,1,2,3,4,5,6,7,8,9,10);
    public $denominations = array(1,2,3,5,10,20,30,50,100,200,300,500,1000);
    public $lang = 'en';
    public $flash_scale_exactfit = 1;

    public $winPay = array(
        array('symbol'=> 's03', 'count'=> 5, 'multiplier'=> 150),
        array('symbol'=> 's03', 'count'=> 4, 'multiplier'=> 75),
        array('symbol'=> 's03', 'count'=> 3, 'multiplier'=> 10),
        array('symbol'=> 's04', 'count'=> 5, 'multiplier'=> 125),
        array('symbol'=> 's04', 'count'=> 4, 'multiplier'=> 75),
        array('symbol'=> 's04', 'count'=> 3, 'multiplier'=> 10),
        array('symbol'=> 's05', 'count'=> 5, 'multiplier'=> 25),
        array('symbol'=> 's05', 'count'=> 4, 'multiplier'=> 8),
        array('symbol'=> 's06', 'count'=> 5, 'multiplier'=> 25),
        array('symbol'=> 's06', 'count'=> 4, 'multiplier'=> 8),
        array('symbol'=> 's07', 'count'=> 5, 'multiplier'=> 15),
        array('symbol'=> 's07', 'count'=> 4, 'multiplier'=> 5),
        array('symbol'=> 's08', 'count'=> 5, 'multiplier'=> 15),
        array('symbol'=> 's08', 'count'=> 4, 'multiplier'=> 5),
        array('symbol'=> 's09', 'count'=> 5, 'multiplier'=> 15),
        array('symbol'=> 's09', 'count'=> 4, 'multiplier'=> 5),
        array('symbol'=> 's10', 'count'=> 5, 'multiplier'=> 15),
        array('symbol'=> 's10', 'count'=> 4, 'multiplier'=> 5),

        array('symbol'=> 's01', 'count'=> 5, 'multiplier'=> 50),
        array('symbol'=> 's01', 'count'=> 4, 'multiplier'=> 15),
        array('symbol'=> 's01', 'count'=> 3, 'multiplier'=> 8),
        array('symbol'=> 's02', 'count'=> 5, 'multiplier'=> 40),
        array('symbol'=> 's02', 'count'=> 4, 'multiplier'=> 12),
        array('symbol'=> 's02', 'count'=> 3, 'multiplier'=> 5),
    );

    public $winPayFree = array(
        array('symbol'=> 's03', 'count'=> 5, 'multiplier'=> 150),
        array('symbol'=> 's03', 'count'=> 4, 'multiplier'=> 75),
        array('symbol'=> 's03', 'count'=> 3, 'multiplier'=> 10),
        array('symbol'=> 's04', 'count'=> 5, 'multiplier'=> 125),
        array('symbol'=> 's04', 'count'=> 4, 'multiplier'=> 75),
        array('symbol'=> 's04', 'count'=> 3, 'multiplier'=> 10),
        array('symbol'=> 's05', 'count'=> 5, 'multiplier'=> 25),
        array('symbol'=> 's05', 'count'=> 4, 'multiplier'=> 8),
        array('symbol'=> 's06', 'count'=> 5, 'multiplier'=> 25),
        array('symbol'=> 's06', 'count'=> 4, 'multiplier'=> 8),
        array('symbol'=> 's07', 'count'=> 5, 'multiplier'=> 15),
        array('symbol'=> 's07', 'count'=> 4, 'multiplier'=> 5),
        array('symbol'=> 's08', 'count'=> 5, 'multiplier'=> 15),
        array('symbol'=> 's08', 'count'=> 4, 'multiplier'=> 5),
        array('symbol'=> 's09', 'count'=> 5, 'multiplier'=> 15),
        array('symbol'=> 's09', 'count'=> 4, 'multiplier'=> 5),
        array('symbol'=> 's10', 'count'=> 5, 'multiplier'=> 15),
        array('symbol'=> 's10', 'count'=> 4, 'multiplier'=> 5),

        array('symbol'=> 's01', 'count'=> 5, 'multiplier'=> 50),
        array('symbol'=> 's01', 'count'=> 4, 'multiplier'=> 15),
        array('symbol'=> 's01', 'count'=> 3, 'multiplier'=> 8),
        array('symbol'=> 's02', 'count'=> 5, 'multiplier'=> 40),
        array('symbol'=> 's02', 'count'=> 4, 'multiplier'=> 12),
        array('symbol'=> 's02', 'count'=> 3, 'multiplier'=> 5),

        array('symbol'=> 'w01', 'count'=> 5, 'multiplier'=> 50),
        array('symbol'=> 'w01', 'count'=> 4, 'multiplier'=> 15),
        array('symbol'=> 'w01', 'count'=> 3, 'multiplier'=> 8),
    );
}