{"splashScreen": {"footer": "Copyright © 2011 IGT. All rights reserved."},"title": "Cleopatra™","MenuCommand": {"howToPlay": "Game Rules","payTable": "Paytable"},"Error": {"insufficientFunds": "Insufficient funds to spin."},"Game": {"goodLuck": "Good Luck","allWinsTripled": "Wins Pay Triple","gameOver": "Play Again","lineWin": "Line Win Pays: {0}","scatterWin": "Scatter Win Pays: {0}","freeSpinWin": "Scatter + Bonus Win Pays: {0}","totalWin": "Game Pays: {0}","bonusWin": "Bonus Win Pays: {0}","winPaid": "Game Pays: {0}","buttonPatternsBet": "LINES","buttonBetPerPattern": "LINE BET","buttonStart": "START","buttonSpin": "SPIN","buttonSkip": "SKIP","buttonOk": "OK","selectorPatternsBet": "Lines","selectorBetPerPattern": "Line Bet","consoleBalance": "Balance","consoleBet": "Total Bet","consoleBonus": "Bonus Win","consoleSpins": "Free Spins","capAward": "Congratulations! <br/>You have won the maximum! <currency>{0}</currency>","capFreeSpin": "Free spins limited to 180. <br/>No more free spins awarded.","bonusInitiated": "{0} FREE SPIN BONUS INITIATED","bonusTotal": "TOTAL <br/>BONUS WIN <br/>{0}","bonusRetrigger": "BONUS <br/>RE-TRIGGERED! <br/>{0}","bonusRetriggerSub": "YOU'VE WON {0} ADDITIONAL FREE SPINS","mboxHowToPlay": [" <h1>Introduction</h1> <p>Take a trip down the Nile and experience the mysteries of ancient Egypt!</p> <p>Just like the extremely popular video slot game enjoyed in land-based casinos all over the world, Cleopatra™ is a 20 payline game packed with exotic flavour.</p> <p>Line wins completed with the wild Cleopatra symbol are doubled in value.</p> <p>Keep your eyes open for the Sphinx - three or more appearing anywhere on the reels start the Cleopatra™ Bonus. Not only do you earn 15 free spins but all wins are 3 times their normal value!</p> <p>No wonder Cleopatra™ is one of the world's most popular games.</p>"," <h1>How To Bet</h1> <p>Cleopatra™ has 20 paylines. You can choose how many paylines you play by pressing the LINES button.</p> <p>You may also adjust the stake per line you wish to play at by pressing the LINE BET button.</p> <p>The total stake per spin is displayed in the TOTAL BET meter.</p> <p>Press the SPIN button to initiate one spin of the reels.</p>"," <h1>Cleopatra™ Bonus</h1> <p>Sphinx symbols appearing in any position on two or more reels earn you a scatter award relative to your total bet. The more Sphinx symbols appearing, the larger your scatter award multiplier. The specific award values can be found in the paytable.</p> <p>In addition, if the Sphinx symbols appear in any position on three or more reels they trigger the Cleopatra™ Bonus.</p> <p>Your effective bet for all of your free spins is exactly the same as the bet you placed when you triggered the bonus.</p> <p>The awards in the Cleopatra™ Bonus are the same awards used in the regular Cleopatra™ game but are tripled in value. This multiplier applies to all awards except the top award (5 Cleopatra symbols).</p> <p>If during a free spin, Sphinx symbols appear on three or more reels, an additional 15 free spins are added to your current free spin bonus (up to a maximum of 180 total free spins within any bonus round).</p> <p>After the last free spin, if you had one or more winning outcomes in the bonus, the total of all awards is displayed.</p>"," <h1>Rules</h1> <p>Malfunction voids all pays and plays.</p> <p>All payline symbols must appear on a played line and on consecutive reels, beginning with the far left reel.</p> <p>Only highest winner paid on each payline.</p> <p>Only highest scatter award paid. Scatter pays are multiplied by the total bet.</p> <p>Coinciding wins on different paylines are added. Scatter awards are independent from payline awards and are also added to the total amount paid.</p> <p>One or more Cleopatra symbols completing a line win doubles the award value, except when the line win consists of only Cleopatra symbols.</p> <p>Regardless of your bet size, there is an award cap on any single transaction. See the paytable for details. A transaction includes the results of the Cleopatra™ Bonus plus the outcome which launched the bonus. If the award cap is reached in the Cleopatra™ Bonus, the bonus may end early before all free spins have been completed.</p>"," <h1>Additional Information</h1> <p>All trademarks are registered trademarks or pending trademarks of IGT in the U.S. and\/or other countries.</p> <p>© 2011 IGT. All rights reserved.</p> <p>Last updated 10 October 2011</p>"],"mboxPaytable": [" <h1>Paytable</h1><table>{paytableLines}</table> <h2>Times Line Bet</h2> <hr/> <p>All line pay symbols must appear on a played line and on consecutive reels, beginning with the far left reel.</p> <p>One or more {w01} substitutes for </p> <blockquote>{s01} {s02} {s03} {s04} {s05} {s06} {s07} {s08} {s09} {s10} {s11}</blockquote> <p>and doubles their pays. Awards comprised entirely of Cleopatra symbols are not doubled.</p>"," <h1>Paylines</h1> <winlinediagrams/>"," <h1>Scatter ‘SPHINX’ pays</h1> <table> <thead> <tr> <th/> <th>2x</th> <th>3x</th> <th>4x</th> <th>5x</th></tr></thead> <tbody> <tr> <th> {b01} </th> <td>  x2 </td> <td>   x5 </td> <td>   x20 </td> <td>   x100 </td></tr></tbody></table> <h2>Times Total Bet</h2> <hr/> <p>Scatter wins are awarded for symbols appearing in any position on the reels for any number of played lines.</p>"," <h1>Cleopatra™ Bonus</h1> <p>3, 4 or 5 {b01} in any position on the reels initiates the Cleopatra™ Bonus.</p> <p>The normal scatter pay is awarded, and 15 free spins are awarded.</p> <p>During the 15 free spins, all pays are tripled except 5 {w01}.</p> <p>Additional free spins (up to a maximum of 180 free spins for your entire bonus) can be initiated during the bonus.</p> <p>The bonus ends when 0 free spins remain, or after 180 free spins have been played.</p> <p>Line wins are multiplied by the line bet of the outcome that triggered the bonus.</p>"," <h1>Payback Information</h1> <p>In accordance with fair gaming practices required in most legal jurisdictions world-wide, each and every game outcome is completely independent.  Your odds of getting any particular outcome are always the same.  The odds do not vary based on your prior outcomes, your bets, your budget, time of day, day of week, etc.  For example, if you win the top award, your chances of winning it on the next play are exactly the same.  Likewise, prior losses do not change your future odds.</p> <p>The expected payback reflects the theoretical return across a very large number of plays by numerous players over an extended period of time.  For this game, the long-term, expected payback is 95.02%. The results for any given player over a play session can vary widely from this long-term expected average in either direction.  The fewer the number of games, the wider the normal variance of actual payback you may experience.</p> <p>The expected payback value is also based upon correct player choices for any games which involve main game and\/or bonus game play strategy.</p> <p>The maximum win on any transaction including the results of the free spins bonus plus the outcome which launched the bonus is capped at  <currency>{awardCap}.</currency></p> <p>Cleopatra is a trademark or registered trademark of IGT in the U.S. and\/or other countries, and is used with permission. © 2011 IGT. All rights reserved.</p>"]}}