<?

class jurassic_parkParams extends Params {

    public $reels = array(
        // раскладка для главной игры.
        array(
            array(2,4,7,6,4,9,5,8,4,2,8,5,6,1,2,5,7,6,2,10,7,6,8,7,5,6,2,8,10,7,1,5,3,7,5,8,2,10,1,6,2,4,1,5,10,8,2,0,0,0,7,8,6,7,8,4,7,1,8,6,0,0,0,2,7,6,8,5,6,4,8,7,4,5,7,1,9,8,7,4,8,6,4,3,7,6,3,2,8,10,7,2,8,4,6,1,8,10,6,1,7,9,2,1,6,8,7,5,6,7,8,1,5,7,6,8,7,2,8,6,5,7,6,8,4,7,6,8,4,7,3,8,1,6,4,8,1,7,6,4,1,7,8,4,3,10,7,8,6,1,9,2,8,7,6,8,7,6,8,7,6,1,2,8,7,6,8,7,5,8,7),
            array(6,5,1,4,7,1,2,6,9,1,7,3,6,2,5,9,7,5,3,1,9,2,7,6,9,2,5,6,7,2,1,0,0,0,9,5,8,2,9,1,7,2,9,5,7,8,2,1,6,5,3,0,0,0,6,7,2,1,6,7,9,1,5,6,9,10,2,1,3,4,6,2,5,9,1,6,2,5,7,10,1,5,2,6,7,3,2,7,3,10,1,9,6,5,9,7,2,6,3,9,5,3,2,10,7,2,5,7,1,9,3,1,7,9,3,7,5,3,1,6,3,9,5,3,1,5,9,2,1,7,2,3,7,2,3,5,9,3,7,5,6,9,1,5,7,3,2,8,9,7,3,2,10,6,3,7,5,9,6,5,1,3,9,2,6,7,9,6,2,3,1,5,9,2,1,9,8,6,7,9,5,7,9,1,7,9,3,7,1,3,9,1,6,9,3,7,9,6,7,9,6,7,9,3,7,9),
            array(6,9,8,6,5,8,6,5,8,4,0,0,0,6,9,8,4,6,9,8,4,9,6,4,2,9,5,4,8,9,6,3,8,9,1,3,2,9,10,5,9,1,4,5,10,8,9,5,4,6,5,1,8,6,5,4,9,8,5,6,9,4,8,6,9,8,6,4,5,9,6,8,2,9,6,8,5,9,0,0,0,6,8,5,9,6,4,5,9,6,8,10,9,6,2,5,8,9,5,7,6,8,5,4,8,5,9,8,6,4,5,8,9,10,4,9,6,4,9,8,7,4,0,9,8,5,9,8,4,7,9,8,6,9,8,4,6,8,5,9,8,5,6,8,5,9,8,5,9,8,5,9,4,8,5,9,6,8,4,9,8),
            array(2,6,7,9,1,5,3,4,5,7,9,5,3,1,5,3,4,9,3,5,1,6,3,7,8,5,2,7,8,1,4,8,9,3,4,9,8,4,5,8,4,10,3,8,9,5,10,3,5,8,10,1,7,8,4,9,1,8,4,3,9,1,5,7,1,5,4,3,5,0,0,0,8,3,5,9,8,3,4,9,10,7,5,9,1,3,9,7,5,3,2,9,1,5,7,8,9,3,7,1,3,8,5,9,8,7,10,1,5,9,3,8,5,7,9,4,3,5,8,7,9,4,5,3,4,7,8,9,10,1,4,5,9,1,5,4,9,8,4,5,9,7,6,4,5,9,4,8,7,3,8,9,4,7,5,3,8,1,7,5,9,8,4,7,5,9,3,7,8,3,5,9,7,5,3,9,7,3,8,1,9,4,8,5,4,7,9,5,3,8,9,4,8,7,1,8,9,10,7,3,9,10,5,4,7,5,9,1,4,7,8,1,4,3,5,7,4,8,3,1,4,7,3,5,9,4,5,7,4,5),
            array(10,2,7,6,8,4,3,9,7,2,4,8,2,6,3,7,4,9,2,7,8,4,7,8,0,0,0,2,6,4,7,8,6,3,4,8,1,6,7,9,4,3,9,8,3,6,2,7,4,6,9,2,3,4,6,2,3,7,8,6,2,7,4,3,6,5,7,2,6,4,3,6,7,3,6,9,8,3,7,4,3,2,8,7,6,10,2,3,9,4,10,8,2,4,3,8,7,4,8,3,6,4,2,3,9,4,3,9,6,7,2,8,9,6,8,9,1,7,8,2,3,9,6,7,8,3,9,6,3,10,9,2,8,4,9,6,8,9,6,2,7,3,6,8,9,10,3,4,7,9,4,7,8,6,9,1,2,6,3,9,7,3,4,8,7,2,8,7,2,6,4,9,8,7,6,8,10,7,3,6,4,2,7,9,10,3,7,8,9,6,7,9,8,6,9,8,4,5,7,4,8,3,7,6,8,7,9,6,7,8,9,7,6,4,2,9,3,8,9,4,6,7,9,8,4,6,9,8,2,7,8,6,7,2,8,6,7,2,9,8,7,6,9,7,8,4,7,9,8,4,3,8,9,5,3),
        ),
    );
    // Символы
    public $symbols = array(
        // Wild
        'W' => array(0),
        // Scatter
        'S' => array(10),
        // T-rex
        'T' => array(5),
        // Velociraptor
        'V' => array(6),
        // Triceratops
        'R' => array(8),
        // Brachiosaurus
        'B' => array(7),
        // Dilophosaurus
        'D' => array(9),
        // В шляпе
        'H' => array(1),
        // Баба
        'M' => array(2),
        // Старый
        'O' => array(3),
        // Модный в очках
        'G' => array(4),
    );
    // Вайлд
    public $wild = array(0);
    // Скаттер
    public $scatter = array(10);
    // Умножение ставки, когда выпали скаттеры
    public $scatterMultiple = array(
        '2' => 1,
        '3' => 2,
        '4' => 20,
        '5' => 100,
    );
    // Выплачивать только максимальный выигрыш на линии
    public $payOnlyHighter = false;

    public $winLines = array();

    public $winLineType = '243';
    public $minWinCount = 3;

    // настройка ставок
    public $currency = '$';
    public $curiso = 'USD';
    public $default_coinvalue = 0.05;
    public $denominations = array(0.01,0.02,0.03,0.04,0.05,0.1,0.25,0.5,1,2,3,4,5,6,7,8,9,10);
    public $lang = 'en';
    public $flash_scale_exactfit = 1;
    // Выплаты
    public $winPay = array(
        array('symbol'=>'W', 'count'=>5, 'multiplier'=>'800.00'),
        array('symbol'=>'W', 'count'=>4, 'multiplier'=>'150.00'),
        array('symbol'=>'W', 'count'=>3, 'multiplier'=>'40.00'),

        array('symbol'=>'H', 'count'=>5, 'multiplier'=>'400.00'),
        array('symbol'=>'H', 'count'=>4, 'multiplier'=>'100.00'),
        array('symbol'=>'H', 'count'=>3, 'multiplier'=>'30.00'),

        array('symbol'=>'M', 'count'=>5, 'multiplier'=>'350.00'),
        array('symbol'=>'M', 'count'=>4, 'multiplier'=>'100.00'),
        array('symbol'=>'M', 'count'=>3, 'multiplier'=>'30.00'),

        array('symbol'=>'O', 'count'=>5, 'multiplier'=>'300.00'),
        array('symbol'=>'O', 'count'=>4, 'multiplier'=>'75.00'),
        array('symbol'=>'O', 'count'=>3, 'multiplier'=>'20.00'),

        array('symbol'=>'G', 'count'=>5, 'multiplier'=>'250.00'),
        array('symbol'=>'G', 'count'=>4, 'multiplier'=>'60.00'),
        array('symbol'=>'G', 'count'=>3, 'multiplier'=>'20.00'),

        array('symbol'=>'T', 'count'=>5, 'multiplier'=>'150.00'),
        array('symbol'=>'T', 'count'=>4, 'multiplier'=>'40.00'),
        array('symbol'=>'T', 'count'=>3, 'multiplier'=>'15.00'),

        array('symbol'=>'V', 'count'=>5, 'multiplier'=>'120.00'),
        array('symbol'=>'V', 'count'=>4, 'multiplier'=>'20.00'),
        array('symbol'=>'V', 'count'=>3, 'multiplier'=>'10.00'),

        array('symbol'=>'B', 'count'=>5, 'multiplier'=>'90.00'),
        array('symbol'=>'B', 'count'=>4, 'multiplier'=>'15.00'),
        array('symbol'=>'B', 'count'=>3, 'multiplier'=>'10.00'),

        array('symbol'=>'R', 'count'=>5, 'multiplier'=>'75.00'),
        array('symbol'=>'R', 'count'=>4, 'multiplier'=>'10.00'),
        array('symbol'=>'R', 'count'=>3, 'multiplier'=>'5.00'),

        array('symbol'=>'D', 'count'=>5, 'multiplier'=>'60.00'),
        array('symbol'=>'D', 'count'=>4, 'multiplier'=>'10.00'),
        array('symbol'=>'D', 'count'=>3, 'multiplier'=>'5.00'),
    );
    public $doubleIfWild = false;
}