<?

class big_bad_wolfParams extends Params {

    // раскладки
    public $reels = array(
        // Основная игра
        array(
            array(0,7,2,9,1,5,4,7,1,5,4,9,3,7,4,6,2,5,11,8,1,6,7,4,9,11,5,1,6,9,4,5,1,9,8,4,7,3,8,1,7,4,9,11,5,4,9,7,1,5,4,7,3,5,4,7,1,5,7,2,5,4,7,6,2,5,11,7,2,7,4,5,6,4,5,3,7,4,9,2,7,11,8,2,5,4,7,1,8,11,5,4,9,2,9,5),
            array(0,6,1,6,3,8,11,7,1,8,11,8,4,6,1,9,8,1,7,3,8,2,8,7,3,8,1,6,4,8,11,7,3,8,1,9,3,8,1,5,3,9,4,8,1,5,3,8,0,8,3,6,1,5,4,6,1,6,2,7,1,5,3,8,1,8,3,6,2,5,3,9,1,8,11,6,3,9,1,8,0,5,3,9,1,9,6,11,9,1,6,0,9,3,6,1,7,3,6,0,9,2,6,11,6,9,3,8),
            array(0,5,2,7,1,9,4,7,11,9,4,7,0,6,2,5,4,8,1,7,4,5,3,7,4,5,0,7,2,9,4,8,2,7,4,8,11,7,4,9,3,7,5,4,7,1,7,11,5,4,9,1,5,4,7,2,5,4,6,2,5,4,7,2,6,4,5,11,7,1,7,4,9,11,5,4,6,3,5,4,5,2,9,1,5,4,8,2,4,9,3,5,2,9,0,5,4,9),
            array(0,8,4,6,2,8,2,8,2,7,0,6,2,9,0,8,1,7,4,8,2,8,2,6,4,8,6,4,9,6,3,6,2,9,0,5,3,9,4,8,6,4,5,4,6,2,7,4,9,1,5),
            array(0,7,1,5,4,8,2,6,1,9,3,7,2,6,0,5,4,8,1,5,6,3,5,1,8,2,7,0,8,2,9,4,6,3,7,1,8,4,5,3,9,2,6,3,7,4,9),
        ),
        // FS
        array(
            array(0,7,1,9,6,2,9,1,5,4,2,3,7,1,6,0,5,11,2,1,9,4,7,11,5,1,6,9,4,5,2,9,11,8,4,7,3,8,1,7,4,9,11,5,4,9,1,7,2,5,4,7,3,5,4,7,1,5,7,1,5,4,7,6,1,5,7,2,7,4,5,0,6,4,5,7,4,9,2,7,8,1,5,4,7,1,8,5,4,9,2,9,5,4),
            array(0,5,1,5,4,9,11,7,4,9,11,8,4,6,1,9,3,7,4,9,2,9,7,4,8,2,9,5,4,8,5,4,8,1,9,4,7,5,4,9,3,7,4,5,0,9,4,6,1,7,4,5,1,5,2,7,1,5,4,7,1,7,4,5,2,5,4,9,1,6,4,9,1,6,0,5,4,9,1,5,11,9,4,6,0,9,4,5,3,7,4,5,0,9,2,6),
            array(0,6,9,0,6,7,11,7,9,4,7,0,6,5,4,8,1,7,4,5,3,7,1,5,4,7,4,7,2,7,4,6,1,7,4,9,1,7,5,4,7,11,5,4,9,1,5,4,7,5,4,6,2,5,4,7,2,6,4,5,0,7,1,7,4,9,11,5,4,8,1,5,4,5,2,9,5,4,6,2,7,4,9,3,5,2,9,1,5,4,9,2,8,3,5,4,9),
            array(0,1,4,8,3,8,2,8,2,7,0,6,2,9,8,1,7,4,8,2,8,2,6,4,8,0,6,4,9,6,3,6,2,9,0,5,3,9,4,5,6,4,5,4,1,6),
            array(0,7,1,5,4,10,2,6,1,9,3,7,2,6,10,5,4,8,1,5,0,8,10,9,3,5,10,2,7,0,8,2,9,4,6,3,10,1,8,4,5,3,9,2,6,3,7,4,9,10,4,7),
        ),
        // FS без Скаттеров
        array(
            array(0,7,2,9,6,2,9,0,1,5,4,2,3,7,1,6,0,5,2,1,9,4,7,11,5,1,6,0,9,4,5,2,9,11,8,4,7,3,8,1,7,4,9,5,4,9,1,7,2,5,4,7,3,5,4,7,1,5,7,2,5,4,7,6,2,5,7,2,7,4,5,6,4,5,3,7,4,9,2,7,11,8,2,5,4,7,1,8,11,5,4,9,2,9,5,3,4),
            array(0,6,1,6,3,8,11,7,1,8,11,8,4,6,1,9,8,1,7,3,8,2,8,7,3,8,1,6,2,8,6,3,8,1,9,3,8,5,3,9,4,8,1,5,3,8,0,8,3,6,1,7,4,6,1,5,2,7,1,5,3,8,1,8,3,6,2,5,3,9,1,6,3,9,1,6,0,5,3,9,1,6,11,9,1,6,0,9,3,6,1,7,3,6,0,9,2,6),
            array(6,1,7,9,6,7,11,9,4,7,6,2,5,4,8,1,7,4,5,3,7,4,5,7,2,9,4,8,2,7,4,8,7,4,9,3,7,5,4,7,1,7,11,5,4,9,1,5,4,7,2,5,4,6,2,5,4,7,2,6,4,5,11,7,1,7,4,9,5,4,6,3,5,4,5,2,9,0,5,4,8,2,7,4,9,3,5,2,9,5,4,9,0,2,3,5,4),
            array(1,8,4,6,3,8,2,8,2,7,0,6,2,9,0,8,1,7,4,8,2,8,2,6,4,8,0,6,4,9,0,6,3,6,2,9,0,5,3,9,4,6,4,5,4,1,6,2),
            array(0,7,1,5,4,7,2,6,1,9,3,7,2,6,3,5,4,8,1,5,0,5,3,5,1,3,2,7,0,8,2,9,4,6,3,5,1,8,4,5,3,9,2,6,3,7,4,9,5,6,3,7,4,9,5),
        ),
    );
    // Символы
    public $symbols = array(
        // Q
        'G' => array(7),
        // Синяя свинья
        'B' => array(2),
        // K
        'F' => array(6),
        // A
        'E' => array(5),
        // Фиолетовая свинья
        'A' => array(1),
        // Wolf
        'S' => array(11),
        // Игрушка
        'D' => array(4),
        // 10
        'I' => array(9),
        // J
        'H' => array(8),
        // Салатовая свинья
        'C' => array(3),
        // Wild
        'W' => array(0),
        // Луна
        'J' => array(10),
    );
    // Вайлд
    public $wild = array(0);
    // Скаттер
    public $scatter = array(11);
    // Умножение ставки, когда выпали скаттеры
    public $scatterMultiple = array(
        '3' => 3,
        '4' => 3,
        '5' => 3,
    );
    // Выигрышные линии
    public $winLines = array(
        array(1,1,1,1,1),
        array(0,0,0,0,0),
        array(2,2,2,2,2),
        array(0,1,2,1,0),
        array(2,1,0,1,2),
        array(0,0,1,0,0),
        array(2,2,1,2,2),
        array(1,2,2,2,1),
        array(1,0,0,0,1),
        array(1,0,1,0,1),
        array(1,2,1,2,1),
        array(0,1,0,1,0),
        array(2,1,2,1,2),
        array(1,1,0,1,1),
        array(1,1,2,1,1),
        array(0,1,1,1,0),
        array(2,1,1,1,2),
        array(0,1,2,2,2),
        array(2,1,0,0,0),
        array(0,2,0,2,0),
        array(2,0,2,0,2),
        array(0,2,2,2,0),
        array(2,0,0,0,2),
        array(0,0,2,0,0),
        array(2,2,0,2,2),
    );
    // Выплачивать только максимальный выигрыш на линии
    public $payOnlyHighter = true;
    // настройка ставок
	public $currency = 'USD';

	public $denominations = array(0.01,0.02,0.03,0.04,0.05,0.1,0.25,0.5,1,2,3,4,5,6,7,8,9,10);
    public $lang = 'en';
    public $flash_scale_exactfit = 1;
    // Выплаты
    public $winPay = array(
        array('symbol'=> 'W', 'count'=> 5, 'multiplier'=> 1000.00),
        array('symbol'=> 'A', 'count'=> 5, 'multiplier'=> 300.00),
        array('symbol'=> 'B', 'count'=> 5, 'multiplier'=> 250.00),
        array('symbol'=> 'C', 'count'=> 5, 'multiplier'=> 250.00),
        array('symbol'=> 'W', 'count'=> 4, 'multiplier'=> 250.00),
        array('symbol'=> 'D', 'count'=> 5, 'multiplier'=> 200.00),
        array('symbol'=> 'A', 'count'=> 4, 'multiplier'=> 150.00),
        array('symbol'=> 'E', 'count'=> 5, 'multiplier'=> 100.00),
        array('symbol'=> 'F', 'count'=> 5, 'multiplier'=> 100.00),
        array('symbol'=> 'G', 'count'=> 5, 'multiplier'=> 100.00),
        array('symbol'=> 'B', 'count'=> 4, 'multiplier'=> 100.00),
        array('symbol'=> 'C', 'count'=> 4, 'multiplier'=> 100.00),
        array('symbol'=> 'H', 'count'=> 5, 'multiplier'=> 75.00),
        array('symbol'=> 'I', 'count'=> 5, 'multiplier'=> 75.00),
        array('symbol'=> 'D', 'count'=> 4, 'multiplier'=> 50.00),
        array('symbol'=> 'W', 'count'=> 3, 'multiplier'=> 50.00),
        array('symbol'=> 'E', 'count'=> 4, 'multiplier'=> 30.00),
        array('symbol'=> 'F', 'count'=> 4, 'multiplier'=> 30.00),
        array('symbol'=> 'A', 'count'=> 3, 'multiplier'=> 25.00),
        array('symbol'=> 'G', 'count'=> 4, 'multiplier'=> 20.00),
        array('symbol'=> 'H', 'count'=> 4, 'multiplier'=> 15.00),
        array('symbol'=> 'I', 'count'=> 4, 'multiplier'=> 15.00),
        array('symbol'=> 'B', 'count'=> 3, 'multiplier'=> 15.00),
        array('symbol'=> 'C', 'count'=> 3, 'multiplier'=> 15.00),
        array('symbol'=> 'D', 'count'=> 3, 'multiplier'=> 15.00),
        array('symbol'=> 'E', 'count'=> 3, 'multiplier'=> 5.00),
        array('symbol'=> 'F', 'count'=> 3, 'multiplier'=> 5.00),
        array('symbol'=> 'G', 'count'=> 3, 'multiplier'=> 5.00),
        array('symbol'=> 'H', 'count'=> 3, 'multiplier'=> 5.00),
        array('symbol'=> 'I', 'count'=> 3, 'multiplier'=> 5.00),
        array('symbol'=> 'W', 'count'=> 2, 'multiplier'=> 5.00),
    );

    // Какие вайлды должны устанавливаться при определенном количестве обвалов
    public $stepWildConfig = array(
        '0' => array(0),
        '2' => array(0,1),
        '4' => array(0,1,2),
        '6' => array(0,1,2,3),
    );

}